In [1]:
# import
import pandas as pd
import numpy as np

import datetime 
from datetime import datetime, date

import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [2]:
metal_values = ["bronze", 'gold', 'silver', 'bronze']
meta_categories = ['bronze', 'gold', 'silver']
metals = pd.Categorical(metal_values,categories=meta_categories, ordered=True)
metals

[bronze, gold, silver, bronze]
Categories (3, object): [bronze < gold < silver]

In [3]:
metals.describe()

            counts  freqs
categories
bronze           2   0.50
gold             1   0.25
silver           1   0.25

In [5]:
metals.value_counts()

bronze    2
gold      1
silver    1
dtype: int64

In [6]:
print(metals.min(), metals.max(), metals.mode() )

bronze silver [bronze]
Categories (3, object): [bronze < gold < silver]

In [7]:
np.random.seed(1234)
names = ['Ivana', 'Norris', 'Ruth', 'Lane', 'Skye', 'Sol', 'Dylan', 'Katrina', 'Alissa', 'Marc']
grades = np.random.randint(50,101,len(names))
scores = pd.DataFrame({'Name':names, 'Grades':grades})
scores

      Name  Grades
0    Ivana      97
1   Norris      69
2     Ruth      88
3     Lane      62
4     Skye      74
5      Sol      65
6    Dylan      99
7  Katrina      73
8   Alissa      91
9     Marc      76

In [9]:
score_bins = [0,59,62,66,69,72,76,79,82,86,89,92,99,100]
letter_grades = ['F', 'D-', 'D', 'D+', 'C-', 'C', 'C+', 'B-', 'B', 'B+', 'A-', 'A', 'A+']
pd.cut(scores.Grades, score_bins, labels=letter_grades)

0     A
1    D+
2    B+
3    D-
4     C
5     D
6     A
7     C
8    A-
9     C
Name: Grades, dtype: category
Categories (13, object): [F < D- < D < D+ ... B+ < A- < A < A+]

In [10]:
scores

      Name  Grades
0    Ivana      97
1   Norris      69
2     Ruth      88
3     Lane      62
4     Skye      74
5      Sol      65
6    Dylan      99
7  Katrina      73
8   Alissa      91
9     Marc      76

In [16]:
score_bins = [0,59,62,66,69,72,76,79,82,86,89,92,99,100]
letter_grades = ['F', 'D-', 'D', 'D+', 'C-', 'C', 'C+', 'B-', 'B', 'B+', 'A-', 'A', 'A+']
pd.cut(scores.Grades, score_bins, labels=letter_grades)

0     A
1    D+
2    B+
3    D-
4     C
5     D
6     A
7     C
8    A-
9     C
Name: Grades, dtype: category
Categories (13, object): [F < D- < D < D+ ... B+ < A- < A < A+]

In [15]:
letter_grades = ['F', 'D-', 'D', 'D+', 'C-', 'C', 'C+', 'B-', 'B', 'B+', 'A-', 'A', 'A+']
pd.cut(scores.Grades, 13, labels=letter_grades)

0    A+
1     D
2    B+
3     F
4    C-
5    D-
6    A+
7    D+
8    A-
9    C-
Name: Grades, dtype: category
Categories (13, object): [F < D- < D < D+ ... B+ < A- < A < A+]

In [17]:
letter_grades = ['F', 'D-', 'D', 'D+', 'C-', 'C', 'C+', 'B-', 'B', 'B+', 'A-', 'A', 'A+']
df1 = pd.qcut(scores.Grades, 5, labels=list(range(5)))
df1

0    4
1    1
2    3
3    0
4    2
5    0
6    4
7    1
8    3
9    2
Name: Grades, dtype: category
Categories (5, int64): [0 < 1 < 2 < 3 < 4]